# Introduction to Pandas

# Series

A series is a one-dimesnional array wih axis labels(an index)

In [3]:
#importing libraries and packages
import numpy as np
import pandas as pd

In [4]:
x = pd.Series([10,20,30,40,50])
x

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [5]:
# We can access different components seperately:
# Accessing the index
x.index

RangeIndex(start=0, stop=5, step=1)

In [6]:
# Accessing the dtyoe
# A series is an ndarray, hus it's homogeneous and CANNOT store multiple dtypes

x.dtypes

dtype('int64')

In [7]:
# Creating a seris with an Index
data = [450,650,870]
Sales = pd.Series(data, index =["Don", "Mike", "Edwin"])
Sales

Don      450
Mike     650
Edwin    870
dtype: int64

In [8]:
type(Sales)

pandas.core.series.Series

In [9]:
Sales.index

Index(['Don', 'Mike', 'Edwin'], dtype='object')

### Accessing Values

In [10]:
# You can access values using the index name
Sales["Don"]

450

### Checking for Conditions

In [11]:
# You can filter based on conditions.
Sales > 500

Don      False
Mike      True
Edwin     True
dtype: bool

In [12]:
# We can-use these booleans
Sales[[False, True, True]]

Mike     650
Edwin    870
dtype: int64

In [13]:
#If we want to see values greater than 500
Sales[Sales>500]

Mike     650
Edwin    870
dtype: int64

In [14]:
#Checking names in the index
"Don" in Sales

True

In [15]:
#False example
"Sally" in Sales

False

In [16]:
450 in Sales
# 450 is not an inex, it is a value, Thus it will return False

False

### Working with Dictionaries

In [17]:
# Converting a Seris to a dictionary
sales_dict = Sales.to_dict()
sales_dict

{'Don': 450, 'Mike': 650, 'Edwin': 870}

In [18]:
#Converting a dict to a series
sales_ser = pd.Series(sales_dict)
sales_ser

Don      450
Mike     650
Edwin    870
dtype: int64

### Adding entries and working with Nan/null Values

In [19]:
#We can create a new seriees froma n existing series
# if we specify namees in the inex that were NOT there already, NaN values will be assignes
new_sales = pd.Series(Sales, index = ["Don", "Mike", "Sally", "Edwin", "luct"])
new_sales

Don      450.0
Mike     650.0
Sally      NaN
Edwin    870.0
luct       NaN
dtype: float64

In [20]:
# We can check if there are any NaN values in a Series.
#For this we use Numpy!
np.isnan(new_sales)

Don      False
Mike     False
Sally     True
Edwin    False
luct      True
dtype: bool

In [21]:
# To check for NULL values use Pandas?
pd.isnull(new_sales)

Don      False
Mike     False
Sally     True
Edwin    False
luct      True
dtype: bool

### Naming componens in a Series

In [22]:
# Name an index
Sales.index.name = "Sales Person"
Sales

Sales Person
Don      450
Mike     650
Edwin    870
dtype: int64

In [23]:
# Naming a Series
Sales.name = "Total tv sales"
Sales

Sales Person
Don      450
Mike     650
Edwin    870
Name: Total tv sales, dtype: int64

## Dataframes

Dataframes are two-dimensional, size-mutable, potentially heterogeneous tabular data structures. This data structure contains TWO Labelle axes (rows and collumns)

### Creating a Dataframe

In [24]:
# Creating a Dataframe from a list
data = [["Adrian", 20], ["Bethany", 23], ["Chloe", 41]]

# When we create a Dataframe, we can specify what the column names are and the data tupe is
df = pd.DataFrame(data, columns = ["Name", "Age"])

df

      Name  Age
0   Adrian   20
1  Bethany   23
2    Chloe   41

### Creating a DF from a directory

In [25]:
# how do you create a data frame from a repository?
# This is useful when working with json

data = data = {
    'Name': ['Alice', 'Bob', 'Charlie'],
    'Age': [25, 30, 35],
    'City': ['New York', 'Los Angeles', 'Chicago']
}
data_frames_ID = pd.DataFrame(data)
data_frames_ID

      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago

### Adding custom indexes

In [26]:
# how to add a custom index?
data_frames_ID.index = ['Alpha', 'Beta', 'Gamma']

data_frames_ID

          Name  Age         City
Alpha    Alice   25     New York
Beta       Bob   30  Los Angeles
Gamma  Charlie   35      Chicago

### Creating a Dataframe from a List of Dictionaries

In [27]:
# how to create a dataframe from a list of dictionaries
# You can do this the same way as creating from one dictionary

data = [
    {'Name': 'Alice', 'Age': 32, 'City': 'New York'},
    {'Name': 'Brian', 'Age': 55, 'City': 'Los Angeles'},
    {'Name': 'Keven', 'Age': 22, 'City': 'Dallas'}
]

# Create DataFrame
dataframe_Ids = pd.DataFrame(data)

dataframe_Ids

    Name  Age         City
0  Alice   32     New York
1  Brian   55  Los Angeles
2  Keven   22       Dallas

### Creating a DataFrame from a Series

In [28]:
# Convert Series to DataFrame
df_sales = Sales.to_frame(name='Sales')

df_sales

              Sales
Sales Person
Don             450
Mike            650
Edwin           870

### Adding a series as a new column on an existing DF

In [29]:
# How do you add a series as a new column on your dataframe?
# You add a new column by naming it in squared brackets and then assign it to the dataframe
gender_series = pd.Series(["Female", "Male", "Male"])
dataframe_Ids["Gender"] = gender_series

dataframe_Ids

    Name  Age         City  Gender
0  Alice   32     New York  Female
1  Brian   55  Los Angeles    Male
2  Keven   22       Dallas    Male

### Shifting/Changing a Dataframe's Index

In [30]:
# You can do this by using some pandas methods
dataframe_Ids_shifted = dataframe_Ids.shift(1)
dataframe_Ids_shifted

    Name   Age         City  Gender
0   None   NaN         None    None
1  Alice  32.0     New York  Female
2  Brian  55.0  Los Angeles    Male

### Filling Missing Values

In [31]:
# How do you fill missing values, can fill wit
# Fill missing values with a specified value
df_filled = dataframe_Ids_shifted.fillna('Unknown')
df_filled

      Name      Age         City   Gender
0  Unknown  Unknown      Unknown  Unknown
1    Alice     32.0     New York   Female
2    Brian     55.0  Los Angeles     Male

### What if We Do Not Want to Fill Every Value with the Same Data?

In [32]:
# Fill with forward fill
df_filled_ffill = dataframe_Ids_shifted.fillna(method='ffill')

df_filled_ffill # Doesnt work as no rows before Unknown

    Name   Age         City  Gender
0   None   NaN         None    None
1  Alice  32.0     New York  Female
2  Brian  55.0  Los Angeles    Male

In [33]:
# Fill with backward fill
df_filled_bfill = dataframe_Ids_shifted.fillna(method='bfill')
df_filled_bfill # Filled with row indice 1

    Name   Age         City  Gender
0  Alice  32.0     New York  Female
1  Alice  32.0     New York  Female
2  Brian  55.0  Los Angeles    Male

### What Does .interpolate() Do?

In [34]:
# This method is used to perform linear interpolation to fill missing values. It works well when the data follows a continous patter
#lets create an example df with missing values (from gpt)
df = pd.DataFrame({'A': [1, None, 3, None, 5]})
df

     A
0  1.0
1  NaN
2  3.0
3  NaN
4  5.0

In [35]:
# We can now interpolate this dataframe using thee correct method
df_interpolated = df.interpolate()
df_interpolated

     A
0  1.0
1  2.0
2  3.0
3  4.0
4  5.0

### How to Drop Values, Rows and Columns

In [36]:
# you can drop values, rows or columns from dataframes using .drop()
data = {
    'Name': ['Alice', 'Bob', 'Charlie'],
    'Age': [25, 30, 35],
    'City': ['New York', 'Los Angeles', 'Chicago']
}

df = pd.DataFrame(data)
df

      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago

In [37]:
# Dropping a Specific Row
df_dropped_row = df.drop(index=1)
df_dropped_row

      Name  Age      City
0    Alice   25  New York
2  Charlie   35   Chicago

In [38]:
# Dropping a specific Column
df_dropped_column = df.drop(columns='City')
df_dropped_column

      Name  Age
0    Alice   25
1      Bob   30
2  Charlie   35

In [39]:
#Drop Rows Based on a Condition
df_filtered = df[df['Age'] <= 30]

df_filtered

    Name  Age         City
0  Alice   25     New York
1    Bob   30  Los Angeles

In [40]:
# More filtering based on values
# Drop filter rows where 'City' is 'Los Angeles'
df_filtered = df[df['City'] != 'Los Angeles']
df_filtered

      Name  Age      City
0    Alice   25  New York
2  Charlie   35   Chicago

In [41]:
#Dropping Rows or Columns based on Missing Values
#Add a missing value to dataframe
df_added_nan = df.copy()
df_added_nan.loc[len(df)] = ["Spencer", "76", None]
df_added_nan

      Name Age         City
0    Alice  25     New York
1      Bob  30  Los Angeles
2  Charlie  35      Chicago
3  Spencer  76         None

In [42]:
# drop rows with any NaN Values
df_dropped_nan_row = df_added_nan.dropna()
df_dropped_nan_row

      Name Age         City
0    Alice  25     New York
1      Bob  30  Los Angeles
2  Charlie  35      Chicago

In [43]:
#drop columns with any NAN values
df_dropped_nan_column = df_added_nan.dropna(axis=1)
df_dropped_nan_column

      Name Age
0    Alice  25
1      Bob  30
2  Charlie  35
3  Spencer  76

In [44]:
# Drop columns and Rows Based on a Index
df_dropped_index = df.drop(index = 2)

df_dropped_index

    Name  Age         City
0  Alice   25     New York
1    Bob   30  Los Angeles

In [45]:
# Drop multiple Items by index
df_dropped_index_mult = df.drop(index = [0,2])
df_dropped_index_mult

  Name  Age         City
1  Bob   30  Los Angeles

In [65]:
# How to remove duplicate rows
#create an example df with duplicates
data = {'Number': [1, 2, 2, 4, 5, 6, 6], 'Letter': ['x', 'y', 'y', 'z', 'a', 'b', 'b']}
df = pd.DataFrame(data)
df

   Number Letter
0       1      x
1       2      y
2       2      y
3       4      z
4       5      a
5       6      b
6       6      b

In [66]:
#removing duplicates using drop
df_no_duplicates = df.drop_duplicates()

df_no_duplicates

   Number Letter
0       1      x
1       2      y
3       4      z
4       5      a
5       6      b

### Finding Duplicate Rows

In [67]:
# Using previous example we can find duplicate rows using this method
duplicates = df[df.duplicated()]
duplicates

   Number Letter
2       2      y
6       6      b

### Selecting Columns

In [70]:
# this selects a column to return a series based on a index
df_num_only = df['Number']

df_num_only

0    1
1    2
2    2
3    4
4    5
5    6
6    6
Name: Number, dtype: int64

### What Is Iloc and What Can You Do With It?

The loc and iloc functions in Pandas are used to slice a data set. The function . loc is primarily used for label indexing, while . iloc is mainly used for integer indexing.

In [71]:
# Iloc is a function used to select data by position based on it's integer index
# For example to select the first row
df.iloc[0]

Number    1
Letter    x
Name: 0, dtype: object

In [72]:
# To select the first two rows
df.iloc[:2]

   Number Letter
0       1      x
1       2      y

In [73]:
# To select specific rows and columns based on index
df.iloc[1:3, 0]

1    2
2    2
Name: Number, dtype: int64

### What is loc and what can you use it for

In [75]:
# New data for example 
data = {
    'ID': [101, 102, 103, 104, 105],
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eve'],
    'Age': [25, 30, 35, 40, 45],
    'City': ['London', 'Paris', 'Berlin', 'New York', 'Tokyo']
}

df_ids2 = pd.DataFrame(data)
df_ids2.set_index('ID', inplace=True) # set ID as index

df_ids2

        Name  Age      City
ID
101    Alice   25    London
102      Bob   30     Paris
103  Charlie   35    Berlin
104    David   40  New York
105      Eve   45     Tokyo

In [93]:
# loc is used to select data based on its labels unlike iloc 
#useful when we know the name but not position
#select based on index 102 ID
df_ids2.loc[102]

Name       Bob
Age         30
City    Madrid
Name: 102, dtype: object

In [78]:
# Multiple Rows by Index Labels
df_ids2.loc[[101, 103, 105]]

        Name  Age    City
ID
101    Alice   25  London
103  Charlie   35  Berlin
105      Eve   45   Tokyo

In [94]:
# How to filter based on condditions
df_ids2[df_ids2['Age'] >= 35]

        Name  Age      City
ID
103  Charlie   35    Berlin
104    David   40  New York
105      Eve   45     Tokyo

In [85]:
# You can also update values after slicing with .loc
df_ids2.loc[102, 'City'] = 'Madrid'
df_ids2.loc[102]

Name       Bob
Age         30
City    Madrid
Name: 102, dtype: object

### How to Sort

In [86]:
data = {
    'Player': ['Alice', 'Bob', 'Charlie', 'David', 'Eve'],
    'Score': [50, 80, 80, 40, 90],
    'Games_Played': [5, 10, 10, 3, 12],
    'Team': ['Red', 'Blue', 'Blue', 'Red', 'Green']
}

df_scores = pd.DataFrame(data)

df_scores

    Player  Score  Games_Played   Team
0    Alice     50             5    Red
1      Bob     80            10   Blue
2  Charlie     80            10   Blue
3    David     40             3    Red
4      Eve     90            12  Green

In [87]:
# How to sort data
df_sorted = df_scores.sort_values(by='Score')

df_sorted

    Player  Score  Games_Played   Team
3    David     40             3    Red
0    Alice     50             5    Red
1      Bob     80            10   Blue
2  Charlie     80            10   Blue
4      Eve     90            12  Green

In [88]:
# How to Sort in Descending Order
df_sorted = df_scores.sort_values(by=['Score', 'Games_Played'], 
                           ascending=[False, True])
df_sorted

    Player  Score  Games_Played   Team
4      Eve     90            12  Green
1      Bob     80            10   Blue
2  Charlie     80            10   Blue
0    Alice     50             5    Red
3    David     40             3    Red

### How to Rank Data?

Ranking Assigns numerical ranks to values

In [91]:
# How to assign
df_scores['Rank'] = df_scores['Score'].rank()
df_scores

    Player  Score  Games_Played   Team  Rank
0    Alice     50             5    Red   2.0
1      Bob     80            10   Blue   3.5
2  Charlie     80            10   Blue   3.5
3    David     40             3    Red   1.0
4      Eve     90            12  Green   5.0

### What is describe

In [95]:
#just gives a general summary statistics of the dataframe
df_scores.describe()

           Score  Games_Played      Rank
count   5.000000      5.000000  5.000000
mean   68.000000      8.000000  3.000000
std    21.679483      3.807887  1.541104
min    40.000000      3.000000  1.000000
25%    50.000000      5.000000  2.000000
50%    80.000000     10.000000  3.500000
75%    80.000000     10.000000  3.500000
max    90.000000     12.000000  5.000000

In [96]:
# finding total of all columns 
df_scores.sum()

Player          AliceBobCharlieDavidEve
Score                               340
Games_Played                         40
Team                RedBlueBlueRedGreen
Rank                               15.0
dtype: object

In [98]:
# finding the cumulitive part
df_scores.cumsum()

                    Player  Score  Games_Played                 Team  Rank
0                    Alice     50             5                  Red   2.0
1                 AliceBob    130            15              RedBlue   5.5
2          AliceBobCharlie    210            25          RedBlueBlue   9.0
3     AliceBobCharlieDavid    250            28       RedBlueBlueRed  10.0
4  AliceBobCharlieDavidEve    340            40  RedBlueBlueRedGreen  15.0

In [103]:
# finding the min
df_scores.min()

Player          Alice
Score              40
Games_Played        3
Team             Blue
Rank              1.0
dtype: object

In [101]:
# FInding the max
df_scores.max()

Player          Eve
Score            90
Games_Played     12
Team            Red
Rank            5.0
dtype: object

### Index Hierarchy

In [104]:
# Creating a DataFrame with a hierarchical index
# We are using numpy arange to create a range of numbers, and re-shaping it so that the numbers will fit on a 4x4 grid
df_temp = pd.DataFrame(np.arange(16).reshape(4,4), 
                       index=[['2018', '2018', '2019', '2019'], ['Jan', 'Feb', 'Jan', 'Feb']],
                       columns=[['NY', 'NY', 'LA', 'LA'], ['Cold', 'Hot', 'Cold', 'Hot']])

# Display the DataFrame
df_temp

           NY       LA
         Cold Hot Cold Hot
2018 Jan    0   1    2   3
     Feb    4   5    6   7
2019 Jan    8   9   10  11
     Feb   12  13   14  15

In [105]:
# We can add index and column names
df_temp.index.names = ['Year', 'Month']
df_temp.columns.names = ['State', 'Temp']

# Display the updated DataFrame
df_temp

State        NY       LA
Temp       Cold Hot Cold Hot
Year Month
2018 Jan      0   1    2   3
     Feb      4   5    6   7
2019 Jan      8   9   10  11
     Feb     12  13   14  15

In [107]:
#using swaplevel to swap levels on a particular axis
# axis -0 or 'index', 1 or 'colums'
df_temp.swaplevel('State', 'Temp', axis = 1)

Temp       Cold Hot Cold Hot
State        NY  NY   LA  LA
Year Month
2018 Jan      0   1    2   3
     Feb      4   5    6   7
2019 Jan      8   9   10  11
     Feb     12  13   14  15

In [109]:
# Sorting based on the first level of the index
df_temp.sort_index(level = 0)

State        NY       LA
Temp       Cold Hot Cold Hot
Year Month
2018 Feb      4   5    6   7
     Jan      0   1    2   3
2019 Feb     12  13   14  15
     Jan      8   9   10  11